{"config": {"name": "model_1", "output_layers": [["dense_7", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 9], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_2", "config": {"activation": "relu", "trainable": true, "use_bias": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 256}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"activation": "linear", "trainable": true, "use_bias": true, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 512}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"activation": "linear", "trainable": true, "use_bias": true, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 512}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "lambda_1", "config": {"arguments": {}, "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "output_shape": [512], "function": ["4wEAAAAAAAAABQAAAAcAAABDAAAAc3wAAAB8AABcAgB9AQB9AgBkAQB9AwB8AQBqAABkAgAZZAMA\nawMAckMAdAEAfAEAagAAZAIAGYMBAAF8AQBqAABkAgAZfQMAdAIAagMAZAQAfAMAdAQAZgIAZAUA\nZAYAZAcAdAUAgwADfQQAfAEAdAIAagYAfAIAgwEAfAQAFBdTKQhO6QQAAADpAAAAAOlAAAAA2gVz\naGFwZdoEbWVhbucAAAAAAAAAANoGc3RkZGV2KQdyBAAAANoFcHJpbnTaAUvaDXJhbmRvbV9ub3Jt\nYWzaCmxhdGVudF9kaW3aC2Vwc2lsb25fc3Rk2gNleHApBdoEYXJnc9oGel9tZWFu2gt6X2xvZ19z\naWdtYdoKYmF0Y2hfc2l6ZdoHZXBzaWxvbqkAchMAAAD6BlZBRS5wedoIc2FtcGxpbmcrAAAAcxAA\nAAAAAQwBBgITAREBDQIVAQ8B\n", null, null], "function_type": "lambda"}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_4", 0, 0, {}]]], "class_name": "Lambda"}, {"name": "dense_5", "config": {"activation": "relu", "trainable": true, "use_bias": true, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 256}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_6", "config": {"activation": "relu", "trainable": true, "use_bias": true, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 64}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_7", "config": {"activation": "sigmoid", "trainable": true, "use_bias": true, "name": "dense_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 3}, "inbound_nodes": [[["dense_6", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}